david15711/STM32workplace/Exp22_1_PushPush_portrait.c
/* ============================================================================ */
/*	Exp21_1_PushPush_portrait.c : 푸시푸시(PushPush) 게임			*/
/* ============================================================================ */
/*					Programmed by Duck-Yong Yoon in 2016.   */

#include "stm32f767xx.h"
#include "OK-STM767.h"

void SysTick_Handler(void);			// SysTick interrupt function by 2Hz
void Draw_symbol(U16 xPos,U16 yPos,U16 color,U08 code);	// draw 16x16 symbol
void Draw_arrow(U16 xPos,U16 yPos,U16 color,U08 code);	// draw 32x32 arrow
void Draw_board(void);				// draw game board
void Draw_control(void);			// draw game control
void Draw_previous(U16 color1, U16 color2);	// display previous stage for touch screen
void Draw_next(U16 color1, U16 color2);		// display previous stage for touch screen
void Draw_clear(U16 color1, U16 color2);	// display clear for touch screen
void Draw_left(U16 color1, U16 color2, U16 color3); // draw left arrow for touch screen
void Draw_right(U16 color1, U16 color2, U16 color3);// draw right arrow for touch screen
void Draw_up(U16 color1, U16 color2, U16 color3);   // draw up arrow for touch screen
void Draw_down(U16 color1, U16 color2, U16 color3); // draw down arrow for touch screen
unsigned char Icon_input(void);			// input touch screen icon
void PushPush(U16 direction);			// push box by direction arrow
unsigned char Check_OK(void);			// check game stage OK

/* ---------------------------------------------------------------------------- */

#define Left		KEY1			// direction by KEY1
#define Right		KEY2			// direction by KEY2
#define Up		KEY3			// direction by KEY3
#define Down		KEY4			// direction by KEY4

#define KEY5		0x11			// previous stage icon of touch screen
#define	KEY6		0x12			// next stage icon of touch screen
#define	KEY7		0x13			// clear icon of touch screen

#define	Xbase		 8			// x base position of board
#define	Ybase		23			// y base position of board

#define stage_max	35			// maximum stage number

unsigned char  beep_flag;			// beep on/off flag
unsigned char  stage;				// game stage
unsigned char  buffer[12][14];			// board buffer of a stage(x=12, y=12)
unsigned short xo, yo;				// current x, y position

/* ----- 게임 스테이지 정의 --------------------------------------------------- */

const unsigned char board[stage_max][12][14]={	/* define board of each stage */
	{ "              ",			// stage 1
	  "              ",
	  "   XXXXXXXX   ",
	  "   XX@ XXXX   ",
	  "   XX *  XX   ",
	  "   XXX X XX   ",
	  "   X0X X  X   ",
	  "   X0*  X X   ",
	  "   X0   * X   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              " },
	{ "              ",			// stage 2
	  "  XXXXXXXXXX  ",
	  "  XX@  XXXXX  ",
	  "  XX **XX  X  ",
	  "  XX *     X  ",
	  "  XXXXXX   X  ",
	  "  XX   X XXX  ",
	  "  XX XXX  XX  ",
	  "  XX X000 XX  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 3
	  "              ",
	  "   XXXXXXXX   ",
	  "   XX00 0XX   ",
	  "   XX0* 0XX   ",
	  "   XX*   XX   ",
	  "   X *  *@X   ",
	  "   X XX*X X   ",
	  "   X      X   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              " },
	{ "              ",			// stage 4
	  "              ",
	  "   XXXXXXX    ",
	  "   XXX  XX    ",
	  "   X *   X    ",
	  "   X X X X    ",
	  "   X * X X    ",
	  "   X *@**X    ",
	  "   X00000X    ",
	  "   XXXXXXX    ",
	  "              ",
	  "              " },
	{ "              ",			// stage 5
	  "              ",
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  X   XXXXXX  ",
	  "  X * 00*  X  ",
	  "  XX* 00**@X  ",
	  "  XX  00*  X  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              ",
	  "              " },
	{ "              ",			// stage 6
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  XX     XXX  ",
	  "  XX*XXX   X  ",
	  "  X @ *  * X  ",
	  "  X 00X * XX  ",
	  "  XX00X   XX  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              ",
	  "              " },
	{ "              ",			// stage 7
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  XXXX  X @X  ",
	  "  XXX   X  X  ",
	  "  XXX* * * X  ",
	  "  XXX *XX  X  ",
	  "  XXX * X XX  ",
	  "  X00000  XX  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 8
	  "  XXXXXXXXXX  ",
	  "  XXX    XXX  ",
	  "  XXX *    X  ",
	  "  XXX * XX X  ",
	  "  X000 *   X  ",
	  "  X000*X* XX  ",
	  "  XXXX X * X  ",
	  "  XXXX  @  X  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 9
	  "  XXXXXXXXX   ",
	  "  X       X  ",
	  "  X X**  XX  ",
	  "  X 000X XX  ",
	  "  XX000* XX  ",
	  "  XX XX * X  ",
	  "  XX*  *  X  ",
	  "  XX  X  @X  ",
	  "  XXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 10
	  "             ",
	  "  XXXXXXXXX  ",
	  "  XXXX0  @X  ",
	  "  X  ***  X  ",
	  "  X0XX0XX0X  ",
	  "  X   *   X  ",
	  "  X  *0X XX  ",
	  "  XXXX   XX  ",
	  "  XXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 11
	  " XXXXXXXXXXXX ",
	  " XXXX   XX  X ",
	  " X@*  00 X  X ",
	  " X   X0X XXXX ",
	  " XX X0 0    X ",
	  " XX XX*XX*X X ",
	  " XX * *     X ",
	  " XXXX   X  XX ",
	  " XXXXXXXXXXXX ",
	  "              ",
	  "              " },
	{ "              ",			// stage 12
	  " XXXXXXXXXXXX ",
	  " X   X   X  X ",
	  " X       X  X ",
	  " XX XXX XXXXX ",
	  " XX   000   X ",
	  " XX*XXX X X X ",
	  " X   *@   * X ",
	  " X   X  XXXXX ",
	  " XXXXXXXXXXXX ",
	  "              ",
	  "              " },
	{ "              ",			// stage 13
	  "              ",
	  "   XXXXXXXX   ",
	  "   X X00X X   ",
	  "   XXX 0XXX   ",
	  "   X   *0XX   ",
	  "   X  *  XX   ",
	  "   X  X** X   ",
	  "   X  @   X   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              " },
	{ "              ",			// stage 14
	  "              ",
	  "   XXXXXXXX   ",
	  "   XX0 00XX   ",
	  "   XX0 *0XX   ",
	  "   XXX  *XX   ",
	  "   X *  * X   ",
	  "   X X*XX X   ",
	  "   X   @  X   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              " },
	{ "              ",			// stage 15
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  X  XXXXXXX  ",
	  "  XXXX    XX  ",
	  "  XX0 *XX XX  ",
	  "  X00* * @ X  ",
	  "  X00 * * XX  ",
	  "  XXXXXX  XX  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 16
	  "              ",
	  "   XXXXXXXX   ",
	  "   X0   0 X   ",
	  "   X X X  X   ",
	  "   X@*  *0X   ",
	  "   XXXXX *X   ",
	  "   X   X  X   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              ",
  	  "              " },
	{ "              ",			// stage 17
	  "              ",
	  "  XXXXXXXXX   ",
	  "  XX00*00XX   ",
	  "  XX00X00XX   ",
	  "  XX *** XX   ",
	  "  XX  *  XX   ",
	  "  XX *** XX   ",
	  "  XX  X@ XX   ",
	  "  XXXXXXXXX   ",
	  "              ",
  	  "              " },
	{ "              ",			// stage 18
	  "              ",
	  "  XXXXXXXXX   ",
	  "  X000000XX   ",
	  "  X  * X XX   ",
	  "  X * X * X   ",
	  "  XX* * * X   ",
	  "  XX  @   X   ",
	  "  XXXXXXXXX   ",
	  "              ",
	  "              ",
	  "              " },
	{ "              ",			// stage 19
	  "              ",
	  "   XXXXXXXX   ",
	  "   XXX    X   ",
	  "   XXX*** X   ",
	  "   X@ *00 X   ",
	  "   X *000XX   ",
	  "   XXXX  XX   ",
	  "   XXXXXXXX   ",
	  "              ",
	  "              ",
	  "              " },
	{ "              ",			// stage 20
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  XXXXXXX  X  ",
	  "  XX    X  X  ",
	  "  XX ***XX X  ",
	  "  XX  X00XXX  ",
	  "  XXX  00* X  ",
	  "  XXX @    X  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 21
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  XX0000 XXX  ",
	  "  XXX000*XXX  ",
	  "  X  *X* * X  ",
	  "  X **  X* X  ",
	  "  X    X   X  ",
	  "  XXXX @ XXX  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 22
	  "              ",
	  " XXXXXXXXXXX  ",
	  " X  X 000X X  ",
	  " XXXX0000X X  ",
	  " X  XXX* XXX  ",
	  " X * *  ** X  ",
	  " X@ * *    X  ",
	  " X   XXX   X  ",
	  " XXXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 23
	  "              ",
	  "  XXXXXXXXXX  ",
	  "  XXX   XXXX  ",
	  "  X   * *  X  ",
	  "  X *   * @X  ",
	  "  XXX**XXXXX  ",
	  "  X X  00X X  ",
	  "  X X0000X X  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 24
	  " XXXXXXXXXXX  ",
	  " X       X X  ",
	  " X  * * *X X  ",
	  " XX X*XX X X  ",
	  " XX 00 00XXX  ",
	  " XXX00 00 XX  ",
	  " X X XX*X XX  ",
	  " X X* * *  X  ",
	  " X X      @X  ",
	  " XXXXXXXXXXX  ",
	  "              " },
	{ "              ",			// stage 25
	  "  XXXXXXXXXX  ",
	  "  XX  XXXXXX  ",
	  "  XX* XX  XX  ",
	  "  X  *@*  XX  ",
	  "  X   XX* XX  ",
	  "  XXX0XX XXX  ",
	  "  XX000* * X  ",
	  "  XXX00    X  ",
	  "  XXXXXXXXXX  ",
	  "              ",
	  "              " },
	{ "              ",			// stage 26
	  " XXXXXXXXXXX  ",
	  " X    X    X  ",
	  " X *@***** X  ",
	  " X         X  ",
	  " XXXXX XXXXX  ",
	  " X  X0  X  X  ",
	  " X  X0  X  X  ",
	  " X  X000X  X  ",
	  " X  X0  X  X  ",
	  " XXXXXXXXXXX  ",
	  "              " },
	{ "              ",			// stage 27
	  "              ",
	  " XXXXXXXXXXX  ",
	  " XXXX    0 X  ",
	  " X  * * *0 X  ",
	  " X  0XXXX0XX  ",
	  " X *0* * @XX  ",
	  " X  0  XXXXX  ",
	  " XXXXXXXXXXX  ",
	  "              ",
	  "              ",
	  "              " },
	{ "              ",			// stage 28
	  " XXXXXXXXXXX  ",
	  " XXX  @   XX  ",
	  " X   * *  XX  ",
	  " X  * * * XX  ",
	  " XXXXX*XXXXX  ",
	  " X  XX 0 00X  ",
	  " X  X  0X  X  ",
	  " X  X 0   0X  ",
	  " X  XXXX  XX  ",
	  " XXXXXXXXXXX  ",
	  "              " },
	{ "              ",			// stage 29
	  " XXXXXXXXXXX  ",
	  " X @X  XXXXX  ",
	  " X **  *   X  ",
	  " X  X0XX*X X  ",
	  " XX*X000   X  ",
	  " XX 000XX*XX  ",
	  " X  XX0XX  X  ",
	  " X  *  *   X  ",
	  " X  X   X  X  ",
	  " XXXXXXXXXXX  ",
	  "              " },
	{ "              ",			// stage 30
	  " XXXXXXXXXXXX ",
	  " XXXXXX0   XX ",
	  " XX  X00XX XX ",
	  " XX  *00   XX ",
	  " XX  X 0X XXX ",
	  " XXX XX*X  XX ",
	  " X *    ** XX ",
	  " X X*X  X  XX ",
	  " X@  XXXXXXXX ",
	  " XXXXXXXXXXXX ",
	  "              " },
	{ "XXXXXXXXXXXXXX",			// stage 31
	  "X00000XXXX   X",
	  "X00000   XXXXX",
	  "X000 0X  X   X",
	  "XXX XXX XX * X",
	  "X **  *   *  X",
	  "X   *   *X   X",
	  "X *  *XX X * X",
	  "X  XX *    XXX",
	  "XX   *@* * X X",
	  "XXXXX    XXX X",
	  "XXXXXXXXXXXXXX" },
	{ "XXXXXXXXXXXXXX",			// stage 32
	  "XX   XXX  X XX",
	  "X  * X  *    X",
	  "X *    X@ *  X",
	  "X   XXXXXX XXX",
	  "XXX*XX  XX XXX",
	  "XX00 XXXX  * X",
	  "XX000  * * * X",
	  "XX000XXXX    X",
	  "XX000X  X ** X",
	  "XXXXXXXXXXX  X",
	  "XXXXXXXXXXXXXX" },
	{ "XXXXXXXXXXXXXX",			// stage 33
	  "X XXX    XXX X",
	  "XXX   *X   X X",
	  "X **   *   X X",
	  "X    *X ** X X",
	  "X *   *   XX X",
	  "XXXXX*X XXXXXX",
	  "X   X  *X @00X",
	  "X   XX*  00X0X",
	  "X    X X*0000X",
	  "X    X   0000X",
	  "XXXXXXXXXXXXXX" },
	{ "XXXXXXXXXXXXXX",			// stage 34
	  "XX    XXX   XX",
	  "XX*X *X * * XX",
	  "XX *  *   *  X",
	  "X0000  XX  X X",
	  "X0XX0  * XX  X",
	  "X0000    *   X",
	  "X0000X*X **  X",
	  "XX *X   X@   X",
	  "XX    * XXXXXX",
	  "XXX  XXXX    X",
	  "XXXXXXXXXXXXXX" },
	{ "XXXXXXXXXXXXXX",			// stage 35
	  "X XXX    XXX X",
	  "X X   X*   XXX",
	  "X X   *   ** X",
	  "X X ** X*    X",
	  "X XX   *   * X",
	  "XXXXXX X*XXXXX",
	  "X00@ X*  X   X",
	  "X0X00  *XX   X",
	  "X0000*X X    X",
	  "X0000   X    X",
	  "XXXXXXXXXXXXXX" }};

