david15711/STM32workplace/Exp22_1_PushPush_portrait.c
/* ----- 인터럽트 처리 프로그램 ----------------------------------------------- */

volatile unsigned char count2Hz, second, minute;

void SysTick_Handler(void)			/* SysTick interrupt function by 2Hz */
{
  count2Hz++;
  if(count2Hz == 2)
    { count2Hz = 0;
      second++;					// increment second
      if(second == 60)				// if second = 60, second = 0
        { second = 0;
          minute++;				// increment minute
          if(minute == 60)			// if minute = 60, minute = 0
            minute = 0;
        }
    }
}

/* ----- 메인 프로그램 -------------------------------------------------------- */

int main(void)					/* main routine of PushPush game */
{
  unsigned char x, y, key, direction = 0;

  Initialize_MCU();				// initialize MCU and kit
  Delay_ms(50);					// wait for system stabilization
  Initialize_LCD();				// initialize text LCD module
  Initialize_TFT_LCD();				// initialize TFT-LCD module
  TFT_portrait_mode();				// portrait mode
  Initialize_touch_screen();			// initialize touch screen

  LCD_string(0x80," OK-STM767 V1.0 ");		// display title
  LCD_string(0xC0,"   Exp21_1.c    ");
  Beep();

  stage = 0;					// initial stage
  beep_flag = 1;				// beep on
  count2Hz = 0;					// initialize time
  second = 0;
  minute = 0;

  SysTick->LOAD  = 13499999;			// 27MHz/(13499999+1) = 2Hz
  SysTick->VAL   = 0;				// clear SysTick Counter
  SysTick->CTRL  = 0x00000003;			// 216MHz/8 = 27MHz, enable SysTick and interrupt

  while(1)
    { TFT_clear_screen();			// clear screen for new stage

      for(y = 0; y < 12; y++)			// get new board and initial @ position
	for(x = 0; x < 14; x++) 
	  { buffer[y][x] = board[stage][y][x];
	    if(buffer[y][x] == '@') 
	      { xo = x;
	        yo = y;
	        buffer[y][x] = ' ';
	      }
          }

      second = 0;				// initialize time
      minute = 0;
      Draw_board();				// draw new board
      Draw_control();				// draw game control

      while(1)					// game of current stage
        { direction = 0;

          key = Key_input();			// key input
          if(key == no_key)			// if no key input, read touch screen icon
            key = Icon_input();

          if(key == KEY1)      direction = Left;
          else if(key == KEY2) direction = Right;
          else if(key == KEY3) direction = Up;
          else if(key == KEY4) direction = Down;
          else if(key == KEY5)			// go previous stage
            { if(stage != 0) stage--;
              else           stage = stage_max - 1; 
	      break;
	    }
          else if(key == KEY6)			// go next stage
            { if(stage != (stage_max-1)) stage++;
              else                       stage = 0;
	      break;
	    }
          else if(key == KEY7)			// clear current stage
	    break;

          PushPush(direction);			// go to push

          TFT_color(White,Black);		// display time
          TFT_xy(6,30); TFT_unsigned_decimal(minute,1,2);
          TFT_xy(9,30); TFT_unsigned_decimal(second,1,2);

          if(Check_OK()) 			// check if stage is OK
            { TFT_string(1,28, Green,Black, "  축하합니다!  ");
              Delay_ms(300);
	      if(beep_flag == 1) Beep_3times();
              Delay_ms(2000);
              if(stage != (stage_max-1)) stage++;
              else                       stage = 0;
	      break;
	    }
	}
    }
}

/* ----- 사용자 정의 함수 ----------------------------------------------------- */

const unsigned short Symbol[6][16] = {				/* define board symbol */
 { 0x07E0,0x0FF0,0x3FFC,0x3FFC,0x7FFE,0xF3CF,0xF3CF,0xFFFF,	// (0) 사람
   0xFFFF,0xEFF7,0xE7E7,0x700E,0x3C3C,0x3FFC,0x0FF0,0x07E0 },
 { 0xFC7F,0xFEFF,0xFEFF,0xFEFF,0xFEFF,0xFEFF,0xFC7F,0x0000,	// (1) 벽
   0x7FFC,0xFFFE,0xFFFE,0xFFFE,0xFFFE,0xFFFE,0x7FFC,0x0000 },
 { 0x0000,0x7FFE,0x7FFE,0x781E,0x7C3E,0x6E76,0x67E6,0x63C6,	// (2) 박스
   0x63C6,0x67E6,0x6E76,0x7C3E,0x781E,0x7FFE,0x7FFE,0x0000 },
 { 0x0000,0x0000,0x0000,0x0000,0x0000,0x07E0,0x07E0,0x07E0,	// (3) 목표점
   0x07E0,0x07E0,0x07E0,0x0000,0x0000,0x0000,0x0000,0x0000 },
 { 0x0000,0x0100,0x0300,0x0700,0x0F00,0x1F00,0x3FFF,0x7FFF,	// (4) left arrow
   0xFFFF,0x7FFF,0x3FFF,0x1F00,0x0F00,0x0700,0x0300,0x0100 },
 { 0x0000,0x0080,0x00C0,0x00E0,0x00F0,0x00F8,0xFFFC,0xFFFE,	// (5) right arrow
   0xFFFF,0xFFFE,0xFFFC,0x00F8,0x00F0,0x00E0,0x00C0,0x0080 }};

void Draw_symbol(U16 xPos,U16 yPos, U16 color, U08 code)	/* draw 16x16 symbol */
{
  unsigned char  x, y;
  unsigned short font;

  for(y = 0; y < 16; y++)
    { TFT_GRAM_address(xPos,yPos+y);
      font = Symbol[code][y];
      for(x = 0; x < 16; x++)
        { if((font << x) & 0x8000) TFT_data(color);	
	  else                     TFT_data(Black);
	}
    }
}

const unsigned short Arrow[4][64] = {				/* define arrow of touch screen */
 { 0x0000,0x0000,0x0000,0x0100,0x0000,0x0300,0x0000,0x0700,	// (0) left arrow
   0x0000,0x0F00,0x0000,0x1F00,0x0000,0x3F00,0x0000,0x7F00, 
   0x0000,0xFF00,0x0001,0xFF00,0x0003,0xFF00,0x0007,0xFF00, 
   0x000F,0xFF00,0x001F,0xFF00,0x003F,0xFF00,0x007F,0xFF00, 
   0x00FF,0xFF00,0x007F,0xFF00,0x003F,0xFF00,0x001F,0xFF00, 
   0x000F,0xFF00,0x0007,0xFF00,0x0003,0xFF00,0x0001,0xFF00, 
   0x0000,0xFF00,0x0000,0x7F00,0x0000,0x3F00,0x0000,0x1F00, 
   0x0000,0x0F00,0x0000,0x0700,0x0000,0x0300,0x0000,0x0100 },
 { 0x0000,0x0000,0x0080,0x0000,0x00C0,0x0000,0x00E0,0x0000,	// (1) right arrow
   0x00F0,0x0000,0x00F8,0x0000,0x00FC,0x0000,0x00FE,0x0000, 
   0x00FF,0x0000,0x00FF,0x8000,0x00FF,0xC000,0x00FF,0xE000, 
   0x00FF,0xF000,0x00FF,0xF800,0x00FF,0xFC00,0x00FF,0xFE00, 
   0x00FF,0xFF00,0x00FF,0xFE00,0x00FF,0xFC00,0x00FF,0xF800, 
   0x00FF,0xF000,0x00FF,0xE000,0x00FF,0xC000,0x00FF,0x8000, 
   0x00FF,0x0000,0x00FE,0x0000,0x00FC,0x0000,0x00F8,0x0000, 
   0x00F0,0x0000,0x00E0,0x0000,0x00C0,0x0000,0x0080,0x0000 },
 { 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,	// (2) down arrow
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000, 
   0x7FFF,0xFFFF,0x3FFF,0xFFFE,0x1FFF,0xFFFC,0x0FFF,0xFFF8, 
   0x07FF,0xFFF0,0x03FF,0xFFE0,0x01FF,0xFFC0,0x00FF,0xFF80, 
   0x007F,0xFF00,0x003F,0xFE00,0x001F,0xFC00,0x000F,0xF800, 
   0x0007,0xF000,0x0003,0xE000,0x0001,0xC000,0x0000,0x8000, 
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000, 
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 },
 { 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,	// (3) up arrow
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000, 
   0x0000,0x8000,0x0001,0xC000,0x0003,0xE000,0x0007,0xF000,
   0x000F,0xF800,0x001F,0xFC00,0x003F,0xFE00,0x007F,0xFF00,
   0x00FF,0xFF80,0x01FF,0xFFC0,0x03FF,0xFFE0,0x07FF,0xFFF0,
   0x0FFF,0xFFF8,0x1FFF,0xFFFC,0x3FFF,0xFFFE,0x7FFF,0xFFFF,
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000, 
   0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 }};

void Draw_arrow(U16 xPos,U16 yPos,U16 color,U08 code)	/* draw 32x32 arrow */
{
  unsigned char x, y;
  unsigned int  font;

  for(y = 0; y < 64; y += 2)
    { TFT_GRAM_address(xPos,yPos+(y/2));
      font = (Arrow[code][y] << 16) | Arrow[code][y+1]; 
      for(x = 0; x < 32; x++)
        { if((font << x) & 0x80000000) TFT_data(color);
	  else                         TFT_data(Black);
	}
    }
}

void Draw_board(void)				/* draw game board */
{
  unsigned short x, y;

  for(y = 0; y < 12; y++)
    { for(x = 0; x < 14; x++)
        { switch(buffer[y][x])
	    { case 'X': Draw_symbol(x*16 + Xbase, y*16 + Ybase, Magenta, 1); // 벽
			break;
	      case '*': Draw_symbol(x*16 + Xbase, y*16 + Ybase, Yellow,  2); // 박스
			break;
	      case '0': Draw_symbol(x*16 + Xbase, y*16 + Ybase, Green,   3); // 목표점
			break;
	      case '@': Draw_symbol(x*16 + Xbase, y*16 + Ybase, Cyan,    0); // 사람
			break;
	      default:  Draw_symbol(x*16 + Xbase, y*16 + Ybase, Black,   0); // 여백
			break;
	    }
	}
      Draw_symbol(xo*16 + Xbase, yo*16 + Ybase, Cyan, 0);
    }

  Draw_symbol(xo*16 + Xbase, yo*16 + Ybase, Cyan, 0);

  Rectangle(4,19, 235,216, White);		// draw outline
}

void Draw_control(void)				/* draw game control */
{
  TFT_string(1,0,White,Blue, "       PushPush 게임        "); // display title

  TFT_string(3,28,Blue,Cyan," 효과음");		// beep on/off
  if(beep_flag == 1)
    TFT_string(10,28,Red,Cyan," ON ");
  else
    TFT_string(10,28,Red,Cyan,"OFF ");

  TFT_string(5,30,White,  Black, "(00:00)");	// display time

