david15711/STM32workplace/Exp22_1_PushPush_portrait.c
  TFT_string(6,32,Magenta,Black, "STAGE");	// display stage
  TFT_string(6,34,Green,  Black, "00/00");
  TFT_color(Green,Black);
  TFT_xy( 6,34); TFT_unsigned_decimal(stage + 1, 1, 2);
  TFT_xy( 9,34); TFT_unsigned_decimal(stage_max, 1, 2);

  Draw_previous(Magenta, Green);		// display stage change
  Draw_next(Magenta, Green);

  Draw_clear(White, Yellow);			// display clear of current stage

  Draw_left(White, Cyan, Yellow);		// draw left (KEY1)
  Draw_right(White, Cyan, Yellow);		// draw right(KEY2)
  Draw_up(White, Cyan, Yellow);			// draw up   (KEY3)
  Draw_down(White, Cyan, Yellow);		// draw down (KEY4)
}

void Draw_previous(U16 color1, U16 color2)	/* display previous stage for touch screen */
{
  Rectangle(14,261, 35,281, color1);
  Draw_symbol(17, 263, color2, 4);
}

void Draw_next(U16 color1, U16 color2)		/* display next stage for touch screen */
{
  Rectangle(101,261, 122,281, color1);
  Draw_symbol(104, 263, color2, 5);
}

void Draw_clear(U16 color1, U16 color2)		/* display clear for touch screen */
{
  Rectangle(45,292, 91,314, color1);
  TFT_string(6,37,color2,Black, "CLEAR");
}

void Draw_left(U16 color1, U16 color2, U16 color3)	/* display left arrow for touch screen */
{
  Draw_arrow(139,255, color2, 0);
  TFT_string(21,33, color3,Black,  "1");
  Line(144,254, 168,254, color1);
  Line(168,254, 185,271, color1);
  Line(185,271, 168,288, color1);
  Line(168,288, 144,288, color1);
  Line(144,288, 144,254, color1);
}

void Draw_right(U16 color1, U16 color2, U16 color3)	/* display right arrow for touch screen */
{
  Draw_arrow(205,255, color2, 1);
  TFT_string(25,33, color3,Black,  "2");
  Line(231,254, 207,254, color1);
  Line(207,254, 190,271, color1);
  Line(190,271, 207,288, color1);
  Line(207,288, 231,288, color1);
  Line(231,288, 231,255, color1);
}

void Draw_up(U16 color1, U16 color2, U16 color3)	/* display up arrow for touch screen */
{
  Draw_arrow(172,222, color2, 3);
  TFT_string(23,31, color3,Black,  "3");
  Line(171,227, 171,251, color1);
  Line(171,251, 188,268, color1);
  Line(188,268, 205,251, color1);
  Line(205,251, 205,227, color1);
  Line(205,227, 172,227, color1);
}

void Draw_down(U16 color1, U16 color2, U16 color3)	/* display down arrow for touch screen */
{
  Draw_arrow(172,288, color2, 2);
  TFT_string(23,35, color3,Black,  "4");
  Line(171,314, 171,290, color1);
  Line(171,290, 188,273, color1);
  Line(188,273, 205,290, color1);
  Line(205,290, 205,314, color1);
  Line(205,314, 171,314, color1);
}

unsigned char icon_flag = 0;

unsigned char Icon_input(void)			/* input touch screen icon */
{
  unsigned char icon;

  Touch_screen_input();				// input touch screen

  if((icon_flag == 0) && (x_touch >= 24) && (x_touch <= 111) && (y_touch >= 224) && (y_touch <= 240))
    { icon = no_key;				// beep on/off
      icon_flag = 1;
      Beep();
      if(beep_flag == 0)
        { beep_flag = 1;
	  TFT_string(10,28,Red, Cyan," ON ");
        }
      else
        { beep_flag = 0;
          TFT_string(10,28,Red, Cyan,"OFF ");
        }
    }
  else if((icon_flag == 0) && (x_touch >= 14) && (x_touch <= 35) && (y_touch >= 261) && (y_touch <= 281))
    { icon = KEY5;				// previous stage
      icon_flag = 1;
      Draw_previous(White, White);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 101) && (x_touch <= 122) && (y_touch >= 261) && (y_touch <= 281))
    { icon = KEY6;				// next stage
      icon_flag = 1;
      Draw_next(White, White);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 45) && (x_touch <= 91) && (y_touch >= 292) && (y_touch <= 314))
    { icon = KEY7;				// clear
      icon_flag = 1;
      Draw_clear(Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 144) && (x_touch <= 172) && (y_touch >= 254) && (y_touch <= 288))
    { icon = KEY1;				// left
      icon_flag = 1;
      Draw_left(Magenta, Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 203) && (x_touch <= 231) && (y_touch >= 254) && (y_touch <= 288))
    { icon = KEY2;				// right
      icon_flag = 1;
      Draw_right(Magenta, Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 171) && (x_touch <= 205) && (y_touch >= 227) && (y_touch <= 255))
    { icon = KEY3;				// up
      icon_flag = 1;
      Draw_up(Magenta, Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 0) && (x_touch >= 171) && (x_touch <= 205) && (y_touch >= 286) && (y_touch <= 314))
    { icon = KEY4;				// down
      icon_flag = 1;
      Draw_down(Magenta, Magenta, Magenta);
      if(beep_flag == 1) Beep();
    }
  else if((icon_flag == 1) && (x_touch == 0) && (y_touch == 0))
    { icon = no_key;
      icon_flag = 0;
      Draw_previous(Magenta, Green);
      Draw_next(Magenta, Green);
      Draw_clear(White, Yellow);
      Draw_left(White, Cyan, Yellow);
      Draw_right(White, Cyan, Yellow);
      Draw_up(White, Cyan, Yellow);
      Draw_down(White, Cyan, Yellow);
      Delay_ms(50);
    }
  else
    icon = no_key;

  return icon;
}

/* ----- 게임 알고리즘 함수 --------------------------------------------------- */

void PushPush(U16 direction)			/* push box by direction arrow */
{
  signed char mx = 0, my = 0;

  if(direction == Left)       mx = -1;		// check direction
  else if(direction == Right) mx = +1;
  else if(direction == Up)    my = -1;
  else if(direction == Down)  my = +1;
  else return;

  if(buffer[yo+my][xo+mx] != 'X')		// 이동할 곳이 벽이 아닌 경우에만
    { if(buffer[yo+my][xo+mx] == '*')		// 이동할 곳에 박스가 있는 경우에만
	{ if((buffer[yo+my*2][xo+mx*2] == ' ') || (buffer[yo+my*2][xo+mx*2] == '0')) // 박스가 갈 곳
	    { if(board[stage][yo+my][xo+mx] == '0')
		buffer[yo+my][xo+mx] = '0';
	      else
	        buffer[yo+my][xo+mx] = ' ';
	      buffer[yo+my*2][xo+mx*2] = '*';
	    }
	  else return;
	}

      if(buffer[yo][xo] == '0')			// 지나간 자리
        Draw_symbol(xo*16 + Xbase, yo*16 + Ybase, Green, 3);
      else if(buffer[yo][xo] == ' ')
        Draw_symbol(xo*16 + Xbase, yo*16 + Ybase, Black, 0);

      Draw_symbol((xo+mx)*16 + Xbase, (yo+my)*16 + Ybase, Cyan, 0); // 사람

      if(buffer[yo+my*2][xo+mx*2] == '*')	// 박스
        Draw_symbol((xo+mx*2)*16 + Xbase, (yo+my*2)*16 + Ybase, Yellow,  2);

      xo += mx;					// 사람이 이동한 새 위치
      yo += my;
    }
}

unsigned char Check_OK(void)			/* check game stage OK */
{
  unsigned char x, y;

  for(y = 0; y < 12; y++)
    for(x = 0; x < 14; x++)
      if((board[stage][y][x] == '0') && (buffer[y][x] != '*'))
	return 0;

  return 1;	
}
